from random import randint


class Jokes:
    def __init__(self):
        # --------------------------------------------------------------------------------------------------------------
        self.j0 = '''Есть такие города, в которые хочется возвращаться и возвращаться. А есть Подольск.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j1 = '''Ваня так сильно намочил манту, что не манту проверяли на Вани, а Ваню на манту.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j2 = '''Парень выругался матом в сексшопе, и случайно заказал товаров на 10к рублей.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j3 = '''У нас в Подольске, ракетоноситель не устройство, а должность.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j4 = '''Шутки не будет. Пупа приняла ИСЛАМ!'''
        # --------------------------------------------------------------------------------------------------------------
        self.j5 = '''Недавно, девочку со слабыми корнями волос, дёрнули за косичку. Для неё это были не повторимые ощущения.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j6 = '''Вы тоже иногда замечаете, что наБЛЮдательные люди голубые…'''
        # --------------------------------------------------------------------------------------------------------------
        self.j7 = '''У нас в Подольске, любят говорить: «одна голова хорошо, а две больше выпьют».'''
        # --------------------------------------------------------------------------------------------------------------
        self.j8 = '''Есть выражение: «одна голова хорошо, а две лучше». Но сиамские близнецы Миша и Денис так не считают.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j9 = '''Штирлиц стрелял в слепую. Но она этого даже не заметила.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j10 = '''Учёные доказали, что у хорошей шутки неожиданный…'''
        # --------------------------------------------------------------------------------------------------------------
        self.j11 = '''Я вот знаю одно крылатое выражение… ОЙ! Улетело.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j12 = '''Прочитав произведение «Му-му, я понял, что значит слово утопия. (дед Мазай антиутопия)'''
        # --------------------------------------------------------------------------------------------------------------
        self.j13 = '''Если бы в нашем мире существовала магия, то Толстой владел бы магией воды.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j14 = '''Когда американец попросил программиста спасти его, он переспросил в формате jpg или png?'''
        # --------------------------------------------------------------------------------------------------------------
        self.j15 = '''Учёные посылают друг друга так: f(u)=ck^u'''
        # --------------------------------------------------------------------------------------------------------------
        self.j16 = '''Гуси делятся на два типа: 1гагага.2Аааа, нападают!!!'''
        # --------------------------------------------------------------------------------------------------------------
        self.j17 = '''Чем отличается вечерний Ургант от обычного. Верно он проходит вечером.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j18 = '''Бурятские учёные открыли глаза'''
        # --------------------------------------------------------------------------------------------------------------
        self.j19 = '''Директор подольского мукомольного завода часто фантазирует о том, что он колумбийский наркоборон.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j20 = '''Хипстер, так сильно повернул джинсы что даже его парень удивился'''
        # --------------------------------------------------------------------------------------------------------------
        self.j21 = '''Одна толстая девочка села на диету и раздавила её.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j22 = '''Бесит, когда идёшь куда-то… и вдруг понимаешь, что тебя туда послали'''
        # --------------------------------------------------------------------------------------------------------------
        self.j23 = '''Если человека послать за очередной бутылкой, и он принесёт одну и пустую, значит, он работает программистом.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j24 = '''Вчера родился человек, который станет следующим мужем Пугачёвой'''
        # --------------------------------------------------------------------------------------------------------------
        self.j25 = '''Дмитрий не видится со своей семьёй уже третий год, потому что он трудоголик, но он работает над этим.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j26 = '''Шампунь против выпадения волос… ну и я, в принципе, тоже.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j27 = '''Мама для грудничка – это сисадмин.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j28 = '''Девиз нашей команды такой: « Если начали, то позоримся до конца»'''
        # --------------------------------------------------------------------------------------------------------------
        self.j29 = '''А вас тоже интересует тот факт, что человеком разумным человек назвал себя сам'''
        # --------------------------------------------------------------------------------------------------------------
        self.j30 = '''Если у практикующего врача есть своё «маленькое кладбище», получается что у каждого практикующего адвоката есть своя зона?'''
        # --------------------------------------------------------------------------------------------------------------
        self.j31 = '''Мутировавший житель чернобыля, знал свой город как свои семь пальцев.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j32 = '''Бассейн на Титанике всё ещё полон'''
        # --------------------------------------------------------------------------------------------------------------
        self.j33 = '''Скандал в пекарне: пекарь взялся не за те булки'''
        # --------------------------------------------------------------------------------------------------------------
        self.j34 = '''Девушка не вовремя сделала каменное лицо и утонула'''
        # --------------------------------------------------------------------------------------------------------------
        self.j35 = '''Жадного ёжика раздавило арбузом.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j36 = '''Студенты Синергии крепко спят, потому что ничего не знают'''
        # --------------------------------------------------------------------------------------------------------------
        self.j37 = '''Самый толстый актер театра теней играет ночь'''
        # --------------------------------------------------------------------------------------------------------------
        self.j38 = '''В 2д вселенной Поле чудес ведёт Яквадратич'''
        # --------------------------------------------------------------------------------------------------------------
        self.j39 = '''Если из фильмов Стетхема убрать перестрелки, то получится что он постоянно куда-то едет и оглядывается'''
        # --------------------------------------------------------------------------------------------------------------
        self.j40 = '''При знакомстве с родителями парень был так хорош, что увел мать из семьи'''
        # --------------------------------------------------------------------------------------------------------------
        self.j41 = '''Дети сварщика не радуются салюту'''
        # --------------------------------------------------------------------------------------------------------------
        self.j42 = '''Мужик знал на что идёт, поставил в ЗАГСе подпись карандашом'''
        # --------------------------------------------------------------------------------------------------------------
        self.j43 = '''Леонардо Ди Каприо не ходит в бассейн, потому что девушки начинают плакать и тащить его на бортик'''
        # --------------------------------------------------------------------------------------------------------------
        self.j44 = '''В гляделках казахи играют в пол силы'''
        # --------------------------------------------------------------------------------------------------------------
        self.j45 = '''Менделеев долго объяснял жене, что на первом месте должен стоять водород, а не семья и дети'''
        # --------------------------------------------------------------------------------------------------------------
        self.j46 = '''Никита учился целоваться на киви, поэтому усики Лены его не смущают'''
        # --------------------------------------------------------------------------------------------------------------
        self.j47 = '''У пекаря второй сын мягче первого'''
        # --------------------------------------------------------------------------------------------------------------
        self.j48 = '''Пока Юрий Куклачёв узнает кто это сделал, это сделает кто-то ещё'''
        # --------------------------------------------------------------------------------------------------------------
        self.j49 = '''Бабушка-проказница звонит в звонок и не успевает убежать'''
        # --------------------------------------------------------------------------------------------------------------
        self.j50 = '''Только в российской армии учат собирать автомат за 10 секунд, потому что только в российской армии автомат может развалиться прямо на поле действий'''
        # --------------------------------------------------------------------------------------------------------------
        self.j51 = '''Пестов лично захотел проверить качество подольских дорог, но как в землю проволился'''
        # --------------------------------------------------------------------------------------------------------------
        self.j52 = '''В семье гримеров непонятно, бьют ли родители детей или нет.'''
        # --------------------------------------------------------------------------------------------------------------
        self.j53 = '''У одинокой кошки живёт 40 бабушек'''
        # --------------------------------------------------------------------------------------------------------------
        self.j54 = '''ОЧень худой мальчик наступил на таракана и поехал до кухни'''
        # --------------------------------------------------------------------------------------------------------------
        self.j55 = '''ОЧень худой мальчик в ветренную погоду не может обьяснить матери где его носит'''
        # --------------------------------------------------------------------------------------------------------------
        self.j56 = '''Песня одинокого кваса. Вечером поздним брожу один...'''
        # --------------------------------------------------------------------------------------------------------------
        self.j57 = '''Средневековая гимнастика: если вдруг вы согрешили сядьте на кол 3-4'''
        # --------------------------------------------------------------------------------------------------------------
        self.j58 = '''Только в новостях всё хорошо'''
        # --------------------------------------------------------------------------------------------------------------
        self.j59 = '''Если у вас нету дома, то на улице тоже есть жизнь кушайте с псами живите с псами'''
        # --------------------------------------------------------------------------------------------------------------
        self.j60 = '''песня про Ленина: тили-тили, трали-вали не сожгли не закапали парам пам пам'''
        # --------------------------------------------------------------------------------------------------------------
        self.j61 = '''О боже Аня, Аня я схожу с ума твоя щетина Аня я больше чем моя'''
        # --------------------------------------------------------------------------------------------------------------
        self.j62 = '''Губки бантиком бровки домиком это Ваничке срезали ломиком'''
        # --------------------------------------------------------------------------------------------------------------

    # return_random_joke------------------------------------------------------------------------------------------------
    def random_joke(self):
        lst = self.__dir__()[:self.__dir__().index('__module__')]
        return self.__getattribute__(lst[randint(0, len(lst) - 1)])


class FunStickers:
    def __init__(self):
        self.s0 = 17985
        self.s1 = 17981
        self.s2 = 13927
        self.s3 = 89
        self.s4 = 15902
        self.s5 = 16998
        self.s6 = 4554
        self.s7 = 16279
        self.s8 = 15350
        self.s9 = 16655
        self.s10 = 9011
        self.s11 = 2473
        self.s12 = 16789
        self.s13 = 16792
        self.s14 = 15789
        self.s15 = 15818
        self.s16 = 15831
        self.s17 = 15814
        self.s18 = 16596

    # return_random_sticker---------------------------------------------------------------------------------------------
    def random_sticker(self):
        lst = self.__dir__()[:self.__dir__().index('__module__')]
        return self.__getattribute__(lst[randint(0, len(lst) - 1)])


class WhatStickers:
    def __init__(self):
        self.s0 = 7332
        self.s1 = 17982
        self.s2 = 15904
        self.s3 = 16591
        self.s4 = 12676
        self.s5 = 14755
        self.s6 = 9704
        self.s7 = 13175
        self.s8 = 13897
        self.s9 = 10582
        self.s10 = 80
        self.s11 = 82
        self.s12 = 69
        self.s13 = 4570
        self.s14 = 3365
        self.s15 = 3375

    # return_random_sticker---------------------------------------------------------------------------------------------
    def random_sticker(self):
        lst = self.__dir__()[:self.__dir__().index('__module__')]
        return self.__getattribute__(lst[randint(0, len(lst) - 1)])
